Repository: OnnoGabriel/wordpress-load-webcomponents
Catalog: languages/load_webcomponents-*.po
Languages: de_de

source: Settings
de_de: Einstellungen

source: Enable loading
de_de: Laden aktivieren

source: Allow src attribute
de_de: src-Attribut erlauben

source: List of available web components
de_de: Liste verfügbarer Webkomponenten

source: Incorrent option.
de_de: Einstellung nicht möglich.

source: Item removed from list.
de_de: Eintrag aus der Liste entfernt.

source: Please enter name <em>and</em> URL for the new web component.
de_de: Bitte einen Namen <em>und</em> eine URL für diese Webkomponente eingeben.

source: Name "%s" is not unique!
de_de: Der Name "%s" ist nicht eindeutig!

source: This is the main switch to (de)activate all web component loaded by this plugin.
de_de: Dies ist der Hauptschalter mit dem das Laden von Webkomponenten (de)aktiviert wird.

source: Allow to add web components via the <code>src="&lt;url&gt;"</code> attribute.
de_de: Das Laden vom Webkomponenten über das <code>src="&lt;url&gt;"</code>-Attribute erlauben.

source: Standard and recommended method is to identify a component by its identifier and define the URL in the list below.
de_de: Die empfohlene Methode ist, eine Webkomponente über ihren Namen zu laden und die URL über die Liste unten zu definieren.

source: Identifier
de_de: Name

source: New
de_de: Neu

source: To delete an item from the list, just delete the identifier and/or URL of the item
de_de: Um einen Eintrag aus der Liste zu löschen, einfach den Namen und/oder die URL löschen.

source: Usage
de_de: Verwendung

source: Load a web component or JavaScript library to a post or page just by adding a shortcode to the content. There are two types of shortcodes available:
de_de: Laden von Webcomponenten oder JavaScript-Bibliotheken in einem Beitrag oder einer Seite über das Hinzufügen eines Shortcodes. Zwei Arten von Shortcodes sind verfügbar:

source: where %s is the URL of the web component or JavaScript library.
de_de: wobei %s die URL der Webkomponente bzw. JavaScript-Bibliothek ist.

source: where %s is the name of the web component and the URL is taken from the list below.
de_de: wobei %s die Name der Webkomponente ist und die URL aus der unten stehenden Liste entnommen wird.

source: The type with <code>name="&lt;identifier&gt;</code> is recommended, because if the URL of a component changes, it has be changed only on this settings page, and not on each post or page using the component.
de_de: Shortcodes mit <code>name="&lt;identifier&gt;</code> werden empfohlen. Falls sich nämlich die URL einer Webkomponente bzw. JavaScript-Bibliothek ändert, muss diese nur hier in den Einstellungen angepasst werden und nicht auf jeder Seite bzw. in jedem Beitrag, in dem der Shortcode verwendet wird.
